perftools/stresstesting/login-and-learn.yml
config:
  target: "http://10.0.0.27:8080"
  phases:
    - duration: 10
      arrivalRate: 5
#    - duration: 30
#      arrivalRate: 20
  processor: "./utils.js"
scenarios:
  - name: "Log in and learn"
    flow:
      - function: "generateRandomUserData"
      - post:
          url: /api/signup/
          json:
            facility: 7de938b6b5ae696d521926e764858120
            full_name: "{{ fullname }}"
            password: "{{ password }}"
            username: "{{ username }}"
      - get:
          url: /learn/#/1d8f6d84618153c18c695d85074952a7/